{
  "_name_or_path": "indolem/indobert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "terimakasih",
    "3": "tokpedbot",
    "4": "pelayanan",
    "5": "pencipta_tokpedbot",
    "6": "direktur_tokopedia",
    "7": "nama",
    "8": "jam_kerja",
    "9": "nomor",
    "10": "produk tokopedia",
    "11": "harga_produk",
    "12": "lokasi",
    "13": "promo",
    "14": "toko",
    "15": "fitur",
    "16": "penempatan",
    "17": "pemilik_tokopedia",
    "18": "random",
    "19": "kata_kasar",
    "20": "apresiasi",
    "21": "metode_pembayaran",
    "22": "pendaftaran_akun",
    "23": "reset_kata_sandi",
    "24": "voucher_diskon",
    "25": "waktu_pengiriman",
    "26": "pengiriman_internasional",
    "27": "kado",
    "28": "kebijakan_harga",
    "29": "pemesanan_telepon",
    "30": "keamanan_pembayaran",
    "31": "program_loyalitas",
    "32": "pesan_tanpa_akun",
    "33": "ulasan_produk",
    "34": "kehabisan_stok",
    "35": "obrolan_langsung",
    "36": "hadiah",
    "37": "layanan_instalasi",
    "38": "demonstrasi_produk",
    "39": "produk_tersedia",
    "40": "camera",
    "41": "handphone",
    "42": "Laptop",
    "43": "mouse",
    "44": "celana",
    "45": "kemeja",
    "46": "sepatu",
    "47": "kacamata",
    "48": "tas",
    "49": "jam_tangan",
    "50": "baju_anak",
    "51": "melakukan_pembelian",
    "52": "mengubah_akun",
    "53": "cara_belanja",
    "54": "menghapus_produk",
    "55": "mencari_produk",
    "56": "konten_umur",
    "57": "verifikasi_tanggal_lahir",
    "58": "tips_belanja",
    "59": "konfirmasi_produk",
    "60": "menghubungi_penjual",
    "61": "diskusi_produk",
    "62": "cek_resi",
    "63": "kesalahan_konfirmasi_penerimaan",
    "64": "transaksi_dibatalkan",
    "65": "berat_barang",
    "66": "kupon",
    "67": "masa_kupon",
    "68": "paket_data",
    "69": "token_listrik",
    "70": "transaksi_gagal",
    "71": "membayar_tagihan",
    "72": "transaksi_berhasil",
    "73": "tiket_kereta_api",
    "74": "membatalkan_tiket_kereta_api",
    "75": "pulsa",
    "76": "pembayaran_PDAM",
    "77": "menghubungkan_akun_ovo",
    "78": "aktivasi_gopay",
    "79": "reksa_dana",
    "80": "tujuan_tokopedia",
    "81": "persyaratan_affiliate_tokopedia",
    "82": "persyaratan_seller_tokopedia",
    "83": "penjelasan_affiliate_tokopedia",
    "84": "manfaat_tokopedia",
    "85": "mitra_tokopedia",
    "86": "ubah_nomor_telepon",
    "87": "pengembalian_dana",
    "88": "gratis_ongkir",
    "89": "masalah_pengiriman",
    "90": "promo_cashback",
    "91": "kendala_akun_diblokir",
    "92": "cek_riwayat_transaksi",
    "93": "update_aplikasi",
    "94": "ubah_alamat_pengiriman",
    "95": "pembelian_preorder",
    "96": "status_refund",
    "97": "laporan_penjual",
    "98": "fitur_langganan",
    "99": "buka_toko",
    "100": "promo_flash_sale",
    "101": "penarikan_saldo",
    "102": "pembayaran_cod",
    "103": "masalah_produk",
    "104": "topup_saldo",
    "105": "penggunaan_ovo",
    "106": "produk_digital",
    "107": "ubah_email_akun",
    "108": "batasan_pembelian",
    "109": "kode_otp",
    "110": "klaim_asuransi_pengiriman",
    "111": "biaya_admin",
    "112": "produk_tidak_tersedia",
    "113": "penghapusan_akun",
    "114": "penggunaan_voucher",
    "115": "batas_waktu_pembayaran",
    "116": "status_pengiriman",
    "117": "produk_rusak",
    "118": "transfer_poin",
    "119": "ubah_metode_pembayaran",
    "120": "klaim_garansi",
    "121": "penggunaan_kartu_kredit",
    "122": "notifikasi_tidak_masuk",
    "123": "penipuan_online",
    "124": "komplain_produk_hilang",
    "125": "promo_tidak_berlaku",
    "126": "masalah_login",
    "127": "penipuan_review",
    "128": "metode_pengiriman",
    "129": "pembatalan_pesanan",
    "130": "penundaan_promo",
    "131": "update_data_bank",
    "132": "pengembalian_barang",
    "133": "klaim_pengiriman_cepat",
    "134": "masalah_aplikasi",
    "135": "masalah_cashback",
    "136": "masalah_retur_barang",
    "137": "kebijakan_garansi_produk",
    "138": "masalah_poin_reward",
    "139": "perubahan_harga_produk",
    "140": "verifikasi_akun",
    "141": "masalah_kupon",
    "142": "promo_khusus_member",
    "143": "masalah_topup",
    "144": "masalah_faktur",
    "145": "masalah_pembayaran_cicilan",
    "146": "pembatalan_otomatis",
    "147": "masalah_email_verifikasi",
    "148": "biaya_pengiriman_berbeda",
    "149": "pengiriman_cepat",
    "150": "masalah_pembayaran",
    "151": "produk",
    "152": "masalah_teknis",
    "153": "keamanan_akun",
    "154": "kehilangan_barang",
    "155": "komplain_penjual",
    "156": "saldo_tokopedia",
    "157": "pesanan_salah",
    "158": "pembatalan_oleh_penjual",
    "159": "ongkir_tidak_termasuk",
    "160": "masalah_chat_penjual",
    "161": "topup_saldo_gagal",
    "162": "kredit_tokopedia",
    "163": "masalah_pengisian_alamat"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Laptop": 42,
    "aktivasi_gopay": 78,
    "apresiasi": 20,
    "baju_anak": 50,
    "batas_waktu_pembayaran": 115,
    "batasan_pembelian": 108,
    "berat_barang": 65,
    "biaya_admin": 111,
    "biaya_pengiriman_berbeda": 148,
    "buka_toko": 99,
    "camera": 40,
    "cara_belanja": 53,
    "cek_resi": 62,
    "cek_riwayat_transaksi": 92,
    "celana": 44,
    "demonstrasi_produk": 38,
    "direktur_tokopedia": 6,
    "diskusi_produk": 61,
    "fitur": 15,
    "fitur_langganan": 98,
    "goodbye": 1,
    "gratis_ongkir": 88,
    "greeting": 0,
    "hadiah": 36,
    "handphone": 41,
    "harga_produk": 11,
    "jam_kerja": 8,
    "jam_tangan": 49,
    "kacamata": 47,
    "kado": 27,
    "kata_kasar": 19,
    "keamanan_akun": 153,
    "keamanan_pembayaran": 30,
    "kebijakan_garansi_produk": 137,
    "kebijakan_harga": 28,
    "kehabisan_stok": 34,
    "kehilangan_barang": 154,
    "kemeja": 45,
    "kendala_akun_diblokir": 91,
    "kesalahan_konfirmasi_penerimaan": 63,
    "klaim_asuransi_pengiriman": 110,
    "klaim_garansi": 120,
    "klaim_pengiriman_cepat": 133,
    "kode_otp": 109,
    "komplain_penjual": 155,
    "komplain_produk_hilang": 124,
    "konfirmasi_produk": 59,
    "konten_umur": 56,
    "kredit_tokopedia": 162,
    "kupon": 66,
    "laporan_penjual": 97,
    "layanan_instalasi": 37,
    "lokasi": 12,
    "manfaat_tokopedia": 84,
    "masa_kupon": 67,
    "masalah_aplikasi": 134,
    "masalah_cashback": 135,
    "masalah_chat_penjual": 160,
    "masalah_email_verifikasi": 147,
    "masalah_faktur": 144,
    "masalah_kupon": 141,
    "masalah_login": 126,
    "masalah_pembayaran": 150,
    "masalah_pembayaran_cicilan": 145,
    "masalah_pengiriman": 89,
    "masalah_pengisian_alamat": 163,
    "masalah_poin_reward": 138,
    "masalah_produk": 103,
    "masalah_retur_barang": 136,
    "masalah_teknis": 152,
    "masalah_topup": 143,
    "melakukan_pembelian": 51,
    "membatalkan_tiket_kereta_api": 74,
    "membayar_tagihan": 71,
    "mencari_produk": 55,
    "menghapus_produk": 54,
    "menghubungi_penjual": 60,
    "menghubungkan_akun_ovo": 77,
    "mengubah_akun": 52,
    "metode_pembayaran": 21,
    "metode_pengiriman": 128,
    "mitra_tokopedia": 85,
    "mouse": 43,
    "nama": 7,
    "nomor": 9,
    "notifikasi_tidak_masuk": 122,
    "obrolan_langsung": 35,
    "ongkir_tidak_termasuk": 159,
    "paket_data": 68,
    "pelayanan": 4,
    "pembatalan_oleh_penjual": 158,
    "pembatalan_otomatis": 146,
    "pembatalan_pesanan": 129,
    "pembayaran_PDAM": 76,
    "pembayaran_cod": 102,
    "pembelian_preorder": 95,
    "pemesanan_telepon": 29,
    "pemilik_tokopedia": 17,
    "penarikan_saldo": 101,
    "pencipta_tokpedbot": 5,
    "pendaftaran_akun": 22,
    "penempatan": 16,
    "pengembalian_barang": 132,
    "pengembalian_dana": 87,
    "penggunaan_kartu_kredit": 121,
    "penggunaan_ovo": 105,
    "penggunaan_voucher": 114,
    "penghapusan_akun": 113,
    "pengiriman_cepat": 149,
    "pengiriman_internasional": 26,
    "penipuan_online": 123,
    "penipuan_review": 127,
    "penjelasan_affiliate_tokopedia": 83,
    "penundaan_promo": 130,
    "persyaratan_affiliate_tokopedia": 81,
    "persyaratan_seller_tokopedia": 82,
    "perubahan_harga_produk": 139,
    "pesan_tanpa_akun": 32,
    "pesanan_salah": 157,
    "produk": 151,
    "produk tokopedia": 10,
    "produk_digital": 106,
    "produk_rusak": 117,
    "produk_tersedia": 39,
    "produk_tidak_tersedia": 112,
    "program_loyalitas": 31,
    "promo": 13,
    "promo_cashback": 90,
    "promo_flash_sale": 100,
    "promo_khusus_member": 142,
    "promo_tidak_berlaku": 125,
    "pulsa": 75,
    "random": 18,
    "reksa_dana": 79,
    "reset_kata_sandi": 23,
    "saldo_tokopedia": 156,
    "sepatu": 46,
    "status_pengiriman": 116,
    "status_refund": 96,
    "tas": 48,
    "terimakasih": 2,
    "tiket_kereta_api": 73,
    "tips_belanja": 58,
    "token_listrik": 69,
    "toko": 14,
    "tokpedbot": 3,
    "topup_saldo": 104,
    "topup_saldo_gagal": 161,
    "transaksi_berhasil": 72,
    "transaksi_dibatalkan": 64,
    "transaksi_gagal": 70,
    "transfer_poin": 118,
    "tujuan_tokopedia": 80,
    "ubah_alamat_pengiriman": 94,
    "ubah_email_akun": 107,
    "ubah_metode_pembayaran": 119,
    "ubah_nomor_telepon": 86,
    "ulasan_produk": 33,
    "update_aplikasi": 93,
    "update_data_bank": 131,
    "verifikasi_akun": 140,
    "verifikasi_tanggal_lahir": 57,
    "voucher_diskon": 24,
    "waktu_pengiriman": 25
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31923
}
